Repository: skladppo33701-collab/sklad_helper
Catalog: lib/l10n/app_*.arb
Languages: kk

# loginTitle
source: Sign in
kk: Кіру

source: Password
kk: Құпиясөз

source: Sign in
kk: Кіру

# signUp
source: Create account
kk: Тіркелу

source: Forgot password?
kk: Құпиясөзді ұмыттыңыз ба?

source: Sign in with Google
kk: Google арқылы кіру

# waitingActivationTitle
source: Waiting for activation
kk: Белсендіру күтілуде

# waitingActivationBody
source: Your account was created. Admin must activate access.
kk: Аккаунт құрылды. Әкімші қолжетімділікті белсендіруі керек.

source: Check again
kk: Қайта тексеру

source: Log out
kk: Шығу

source: Assignments
kk: Тапсырмалар

# tasks
source: Plan
kk: Жоспар

source: Profile
kk: Профиль

# barcodeAlreadyBound
source: Barcode already bound to: {article}
kk: Штрих-код мына тауарға тіркелген: {article}

# productNotFound
source: Product not found: {article}
kk: Тауар табылмады: {article}

# labelArticle
source: Article
kk: Артикул

# labelCategory
source: Category
kk: Санат

# labelBrand
source: Brand
kk: Бренд

# labelBarcode
source: Barcode
kk: Штрих-код

# labelName
source: Name
kk: Атауы

# catalogTitle
source: Catalog
kk: Каталог

# searchByArticle
source: Search by Name/Article
kk: Атауы/артикул бойынша іздеу

source: Load More
kk: Тағы жүктеу

# listEnd
source: End of list
kk: Тізім соңы

# statusBinding
source: Binding...
kk: Тіркеу...

# actionBindBarcode
source: Bind Barcode
kk: Штрих-кодты тіркеу

# errorNotAllowed
source: Not allowed.
kk: Рұқсат етілмеген.

# errorGeneric
source: Error: {error}
kk: Қате: {error}

# successBound
source: Barcode bound successfully
kk: Штрих-код сәтті тіркелді

# errorNotSignedIn
source: Not signed in
kk: Сіз жүйеге кірмедіңіз

source: Scan cancelled
kk: Сканерлеу тоқтатылды

# barcodeUnknown
source: Unknown barcode
kk: Белгісіз штрих-код

# wrongItem
source: Wrong item scanned. Expected: {expected}
kk: Басқа тауар. Күтілгені: {expected}

# transferTitle
source: Transfer
kk: Ауыстыру

source: Transfer not found
kk: Ауыстыру табылмады

# listEmpty
source: List is empty
kk: Тізім бос

source: Status
kk: Күйі

source: Items
kk: Позициялар

# errorLockedByOther
source: Locked by another user
kk: Басқа пайдаланушы құлыптаған

# errorAlreadyHoldingLock
source: You already have an active task
kk: Сізде белсенді тапсырма бар

# errorLockExpired
source: Lock expired
kk: Құлыптау уақыты аяқталды

# errorNotLockOwner
source: You are not the owner of this lock
kk: Сіз бұл тапсырманың орындаушысы емессіз

# errorOverPick
source: Cannot pick more than planned
kk: Жоспардан артық жинауға болмайды

# errorOverCheck
source: Cannot check more than planned
kk: Жоспардан артық тексеруге болмайды

# valEmpty
source: Empty barcode
kk: Бос штрих-код

# valNumericOnly
source: Digits only (EAN-8 / EAN-13)
kk: Тек сандар (EAN-8 / EAN-13)

# valChecksum
source: Invalid EAN-13 checksum
kk: EAN-13 бақылау сомасы қате

# valLength
source: Only EAN-8 (8 digits) or EAN-13 (13 digits)
kk: Тек EAN-8 (8 сан) немесе EAN-13 (13 сан)

# statusNew
source: New
kk: Жаңа

# statusPicking
source: Picking
kk: Орындалуда

# statusPicked
source: Picked
kk: Жиналды

# statusChecking
source: Checking
kk: Тексеру

# statusDone
source: Done
kk: Дайын

# btnStartChecking
source: Start Checking
kk: Тексеруді бастау

# btnFinish
source: Finish
kk: Аяқтау

# btnFinishPicking
source: Finish Picking
kk: Жинауды аяқтау

# btnPrepare
source: Prepare
kk: Дайындау

# btnScan
source: Scan
kk: Скан

# btnCancel
source: Cancel
kk: Болдырмау

# btnCheck
source: Check
kk: Тексеру

# btnCancelCheck
source: Cancel Check
kk: Тексер. болд.

source: Save
kk: Сақтау

source: Delete
kk: Жою

# confirmDelete
source: Are you sure you want to delete this?
kk: Жоюды растайсыз ба?

# msgCheckingStarted
source: Checking started
kk: Тексеру басталды

# msgFinishBlocked
source: Cannot finish: not all items checked
kk: Аяқтау мүмкін емес: бәрі тексерілмеген

# msgFinished
source: Finished
kk: Аяқталды

# msgChecked
source: Checked +1
kk: Тексерілді +1

# msgCheckCancelled
source: Check cancelled
kk: Тексеру тоқтатылды

# subPicked
source: Picked {picked}/{planned}
kk: Жиналды {picked}/{planned}

# subChecked
source: Checked {checked}/{planned}
kk: Тексерілді {checked}/{planned}

# subLockedPick
source: Locked (pick)
kk: Құлыпталды (жинау)

# subLockedCheck
source: Locked (check)
kk: Құлыпталды (тексеру)

# scanTitle
source: Scan Barcode
kk: Штрих-кодты сканерлеу

# notificationsTitle
source: Notifications
kk: Хабарламалар

source: No notifications
kk: Хабарламалар жоқ

# navHome
source: Home
kk: Басты

# navTransfers
source: Transfers
kk: Ауыстырулар

# navCatalog
source: Catalog
kk: Каталог

source: Account
kk: Аккаунт

source: Guest
kk: Қонақ

source: Active
kk: Белсенді

source: Inactive
kk: Белсенді емес

source: Language
kk: Тіл

source: Admin: Users
kk: Админ: Пайдаланушылар

# adminProducts
source: Admin: Products DB
kk: Админ: Тауарлар базасы
